Revit 2027 API
DockableFrameFocusChangedEventArgs Class
 The event arguments used by the DockableFrameActivatedChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class DockableFrameFocusChangedEventArgs : RevitAPISingleEventArgs
Public Class DockableFrameFocusChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class DockableFrameFocusChangedEventArgs : public RevitAPISingleEventArgs
type DockableFrameFocusChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The DockableFrameFocusChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
FocusGained |  True if the pane is being activated, false if it is being inactivated.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
PaneId |  The identifier for dockable pane.
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace